[Killed] BlockStatement
src/app/data-stuff.service.ts:13:31
   
   constructor(private httpClient: HttpClient) { }
   
-  getStuff(): Promise<String> {
-       return firstValueFrom(this.httpClient.get<any>('https://dummyjson.com/products/1'));
-  }
+  getStuff(): Promise<String> {}
 }
 
killedBy: DataStuffService should call getAllBooks and return an array of Books
statusReason: TypeError: Cannot read properties of undefined (reading 'then')

[Killed] StringLiteral
src/app/data-stuff.service.ts:14:55
   constructor(private httpClient: HttpClient) { }
   
   getStuff(): Promise<String> {
-       return firstValueFrom(this.httpClient.get<any>('https://dummyjson.com/products/1'));
+       return firstValueFrom(this.httpClient.get<any>(""));
   }
 }
killedBy: DataStuffService should call getAllBooks and return an array of Books
statusReason: Error: Expected one matching request for criteria "Match method: GET, URL: https://dummyjson.com/products/1", found none. Requests received are: GET .
